## project - Titanic dataset
**For understanding the titanic data:** https://www.kaggle.com/c/titanic/data. Not the "overview" (machine learning) section; only __"Data Dictionary"__ and __"Variable Notes"__.

#### Questions
- How many columns are there in the data sets? Print them below as a list. (Google in case you need help)
- What is the number of passengers in the data sets?
- What percentage of the passengers are males?
- How many of them were female children (Age <18)?\
- What is the overall survival rate?
- Is there a difference in survival rates between males and females? If so, what is that difference?
- What are the minimum and maximum ages of the passengers? Who were they? Did they survive? Why?

In [72]:
df_titanic.columns
len(df_titanic.columns)
len(df_titanic)
total_pass =df_titanic['PassengerId']
len(total_pass)

891

In [71]:
male=df_titanic[df_titanic.Sex == 'male']
len(male)
per_of_male = (len(male))/(len(df_titanic)) *100
np.round(per_of_male,decimals= 2)

64.76

In [73]:
female= df_titanic[df_titanic.Sex == 'female']
children = df_titanic[df_titanic.Age < 18]
female_children = df_titanic[(df_titanic.Sex == 'female') & 
                             (df_titanic.Age < 18 )]
len(female_children)

55

In [74]:
survived = df_titanic[df_titanic.Survived == 1]
len(survived)
survival_rate = len(survived)/len(total_pass) * 100
survival_rate

38.38383838383838

In [75]:
age = df_titanic.Age
print(age.min())
print(age.max())
df_titanic.loc[df_titanic['Age'] == .42]
df_titanic.loc[df_titanic['Age'] == 80.0]

0.42
80.0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin,SiblingSpouse,ParentChildren
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S,A,solo,solo

### Basic Questions:

1. Show that the ticket class is a good indication of socio-economic status (poor, middle-class, rich).

2. Who were the passengers (what were their characteristics)?

3. What deck were the passengers on and how did that relate to their class booking? FYI The letters in the cabin numbers indicate the deck (also see https://66.media.tumblr.com/f8eafe09144867b00c5a7f31a68c51f8/tumblr_mr65khDO0k1ql9hvko1_1280.jpg).

4. Where did the passengers come from (port of embarkation)?

5. Who was alone and who was with family?

### Deeper Analysis:

1. What factors helped people survive (probably)?

2. Did deck level matter? Or class? Or port of embarkation?

3. Did having a family member matter?

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_titanic = pd.read_csv("titanic.csv")

In [3]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## basic questions

### 1.Show that the ticket class is a good indication of socio-economic status (poor, middle-class, rich)
- max price was high for pclass 1
- average fare was high for pclass1
- number of cabin in pclass was more

In [5]:
 df_se = df_titanic.loc[ :,['Ticket' , 'Pclass' ,'Fare','Cabin']]
 df_se

               Ticket  Pclass     Fare Cabin
0           A/5 21171       3   7.2500   NaN
1            PC 17599       1  71.2833   C85
2    STON/O2. 3101282       3   7.9250   NaN
3              113803       1  53.1000  C123
4              373450       3   8.0500   NaN
..                ...     ...      ...   ...
886            211536       2  13.0000   NaN
887            112053       1  30.0000   B42
888        W./C. 6607       3  23.4500   NaN
889            111369       1  30.0000  C148
890            370376       3   7.7500   NaN

[891 rows x 4 columns]

In [6]:
df_se.groupby('Pclass').Fare.agg([ len,min ,max ])

        len  min       max
Pclass
1       216  0.0  512.3292
2       184  0.0   73.5000
3       491  0.0   69.5500

In [7]:
df_se.groupby('Pclass').Fare.mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [8]:
df_se.groupby('Pclass').Cabin.count()

Pclass
1    176
2     16
3     12
Name: Cabin, dtype: int64

### 2 .Who were the passengers (what were their characteristics)?
- more older people
- more male in class 1 then woman

In [9]:
df_titanic.groupby(['Pclass', 'Sex']).Age.mean().reset_index()

   Pclass     Sex        Age
0       1  female  34.611765
1       1    male  41.281386
2       2  female  28.722973
3       2    male  30.740707
4       3  female  21.750000
5       3    male  26.507589

In [10]:
df_titanic.groupby(['Pclass', 'Sex']).Sex.count()

Pclass  Sex
1       female     94
        male      122
2       female     76
        male      108
3       female    144
        male      347
Name: Sex, dtype: int64

In [11]:
df_titanic.groupby(['Pclass','SibSp']).SibSp.count()

Pclass  SibSp
1       0        137
        1         71
        2          5
        3          3
2       0        120
        1         55
        2          8
        3          1
3       0        351
        1         83
        2         15
        3         12
        4         18
        5          5
        8          7
Name: SibSp, dtype: int64

In [12]:
df_titanic.groupby(['Pclass','Parch']).Parch.count()

Pclass  Parch
1       0        163
        1         31
        2         21
        4          1
2       0        134
        1         32
        2         16
        3          2
3       0        381
        1         55
        2         43
        3          3
        4          3
        5          5
        6          1
Name: Parch, dtype: int64

### What deck were the passengers on and how did that relate to their class booking? FYI The letters in the cabin numbers indicate the deck
- most was fro 1st class preple
- most 1 st class people had cabin
- most 1st class cabin were located in deck B ,C,D,E
- mainly deck A,B,C,D were for 1st class booking

In [15]:
df_titanic.groupby('Pclass').Cabin.count()

Pclass
1    176
2     16
3     12
Name: Cabin, dtype: int64

In [64]:
df_titanic['cabin'] = df_titanic.Cabin.str[0]
df_titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin,SiblingSpouse,ParentChildren
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN,small family,solo
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,small family,solo
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN,solo,solo

In [17]:
df_titanic.groupby(['cabin','Pclass']).cabin.count()

cabin  Pclass
A      1         15
B      1         47
C      1         59
D      1         29
       2          4
E      1         25
       2          4
       3          3
F      2          8
       3          5
G      3          4
T      1          1
Name: cabin, dtype: int64

### Where did the passengers come from (port of embarkation)?
	C = Cherbourg, Q = Queenstown, S = Southampton
- most prople came from s and c

In [18]:
df_titanic.groupby('Embarked').PassengerId.count()

Embarked
C    168
Q     77
S    644
Name: PassengerId, dtype: int64

### Who was alone and who was with family?
- most of the people were along or with spouse
- most male were along then female
- female are most likely with family
- mostly adult people traveled alone

In [20]:
df_titanic.groupby(['SibSp','Parch','Sex']).PassengerId.count()

SibSp  Parch  Sex
0      0      female    126
              male      411
       1      female     24
              male       14
       2      female     20
              male        9
       3      female      1
       4      female      1
       5      female      2
1      0      female     63
              male       60
       1      female     26
              male       31
       2      female     11
              male        8
       3      female      2
              male        1
       4      female      1
              male        2
       5      female      2
              male        1
       6      female      1
2      0      female      3
              male       13
       1      female      5
              male        2
       2      female      4
       3      female      1
3      0      female      2
       1      female      5
              male        2
       2      female      4
              male        3
4      1      male        9
       2      female      6
              male        3
5      2      female      1
              male        4
8      2      female      3
              male        4
Name: PassengerId, dtype: int64

In [39]:
df_titanic.groupby(['SibSp','Parch']).Age.agg([min,max])

               min   max
SibSp Parch
0     0       5.00  80.0
      1       0.42  65.0
      2       0.83  58.0
      3      24.00  24.0
      4      29.00  29.0
      5      39.00  41.0
1     0      12.00  63.0
      1       0.67  70.0
      2       0.92  48.0
      3      16.00  54.0
      4      40.00  64.0
      5      38.00  39.0
      6      43.00  43.0
2     0      16.00  53.0
      1       0.75  24.0
      2       9.00  21.0
      3      24.00  24.0
3     0      30.00  33.0
      1       2.00   8.0
      2       2.00  24.0
4     1       1.00  16.0
      2       2.00  17.0
5     2       1.00  16.0
8     2        NaN   NaN

In [40]:
df_titanic.groupby(['SibSp','Parch','Sex']).Age.mean()

SibSp  Parch  Sex
0      0      female    30.150000
              male      32.901316
       1      female    27.086957
              male      33.530000
       2      female    20.705882
              male      21.536667
       3      female    24.000000
       4      female    29.000000
       5      female    40.000000
1      0      female    31.806122
              male      32.311321
       1      female    29.160000
              male      25.258621
       2      female    21.200000
              male      19.417143
       3      female    51.000000
              male      16.000000
       4      female    45.000000
              male      52.000000
       5      female    38.500000
              male      39.000000
       6      female    43.000000
2      0      female    35.500000
              male      31.181818
       1      female     6.900000
              male      12.000000
       2      female    17.250000
       3      female    24.000000
3      0      female    31.500000
       1      female     5.500000
              male       2.000000
       2      female    14.500000
              male      11.000000
4      1      male       6.777778
       2      female     8.333333
              male       5.333333
5      2      female    16.000000
              male       8.750000
8      2      female          NaN
              male            NaN
Name: Age, dtype: float64

## What factors helped people survive (probably)?
- more female is survived
- percentage of children to survive is more which is around 60%
- more the fare more the survival chance

In [68]:
df_titanic.groupby('Survived').Fare.mean() #more the fare more people has survived

Survived
0    22.117887
1    48.395408
Name: Fare, dtype: float64

In [42]:
df_titanic.groupby(['Survived','Sex']).PassengerId.count().reset_index()

   Survived     Sex  PassengerId
0         0  female           81
1         0    male          468
2         1  female          233
3         1    male          109

In [65]:
total_children= (df_titanic[(df_titanic.Age<18)])
print(len(total_children))
total_children_survived = df_titanic[(df_titanic.Age < 18) & (df_titanic.Survived == 1)]
print(len (total_children_survived))
per_children_survived = len(total_children_survived)/len(total_children)*100
print(per_children_survived)

113
61
53.98230088495575

53.98230088495575

In [66]:
total_adult= (df_titanic[(df_titanic.Age>=18) & (df_titanic.Age<40)])
print(len(total_adult))
total_adult_survived = df_titanic[(df_titanic.Age >= 18) & 
                                  (df_titanic.Age<40)& (df_titanic.Survived == 1)]
print(len (total_adult_survived))
per_adult_survived = len(total_adult_survived)/len(total_adult)*100
print(per_adult_survived)

438
168
38.35616438356164

In [67]:
total_old= (df_titanic[(df_titanic.Age>18)])
print(len(total_old))
total_old_survived = df_titanic[(df_titanic.Age > 18) & (df_titanic.Survived == 1)]
print(len (total_old_survived))
per_old_survived = len(total_old_survived)/len(total_old)*100
print(per_old_survived)

575
220
38.26086956521739

### Did deck level matter? Or class? Or port of embarkation?
- from the people from cabin deck B,C,D,E had most survival rate
- most people from embarked s died
- most 1st class people survived

In [49]:
df_titanic.groupby(['Pclass', 'Survived']).PassengerId.count().reset_index()

   Pclass  Survived  PassengerId
0       1         0           80
1       1         1          136
2       2         0           97
3       2         1           87
4       3         0          372
5       3         1          119

In [50]:
df_titanic.groupby(['Survived','Embarked']).PassengerId.count()

Survived  Embarked
0         C            75
          Q            47
          S           427
1         C            93
          Q            30
          S           217
Name: PassengerId, dtype: int64

In [51]:
df_titanic.groupby([ 'cabin','Survived']).PassengerId.count().reset_index()

   cabin  Survived  PassengerId
0      A         0            8
1      A         1            7
2      B         0           12
3      B         1           35
4      C         0           24
5      C         1           35
6      D         0            8
7      D         1           25
8      E         0            8
9      E         1           24
10     F         0            5
11     F         1            8
12     G         0            2
13     G         1            2
14     T         0            1

### 3. Did having a family member matter?
- most people traveled along
- changes of survival with small family is more

In [52]:
import numpy as np

In [53]:
conditions =[(df_titanic['SibSp'] <1 ),
            (df_titanic['SibSp'] >=1 )& (df_titanic['SibSp']<=3),
            (df_titanic['SibSp'] >3) & (df_titanic ['SibSp']<=5),
            (df_titanic['SibSp'] >5)]
values = ['solo','small family','avg family','big family']
df_SiblingSpouse = np.select(conditions,values)
df_titanic['SiblingSpouse'] = df_SiblingSpouse
df_titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin,SiblingSpouse,ParentChildren
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN,small family,solo
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,small family,solo
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN,solo,solo

In [54]:
conditions =[(df_titanic['Parch'] <1 ),
            (df_titanic['Parch'] >=1 )& (df_titanic['Parch']<=3),
            (df_titanic['Parch'] >3) & (df_titanic ['Parch']<=5),
            (df_titanic['Parch'] >5)]
values = ['solo','small family','avg family','big family']
df_ParentChildren = np.select(conditions,values)
df_titanic['ParentChildren'] = df_ParentChildren
df_titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin,SiblingSpouse,ParentChildren
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN,small family,solo
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,small family,solo
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN,solo,solo

In [55]:
df_titanic.groupby(['SiblingSpouse','Survived']).PassengerId.count()

SiblingSpouse  Survived
avg family     0            20
               1             3
big family     0             7
small family   0           124
               1           129
solo           0           398
               1           210
Name: PassengerId, dtype: int64

In [56]:
df_titanic.groupby(['ParentChildren','Survived']).PassengerId.count()

ParentChildren  Survived
avg family      0             8
                1             1
big family      0             1
small family    0            95
                1           108
solo            0           445
                1           233
Name: PassengerId, dtype: int64

In [57]:
total_solo= (df_titanic[(df_titanic.SiblingSpouse =='solo') ])
print(len(total_solo))
total_solo_survived = df_titanic[(df_titanic.SiblingSpouse == 'solo') & 
                                  (df_titanic.Survived == 1)]
print(len (total_solo_survived))
per_solo_survived =len(total_solo_survived)/len(total_solo)*100
print(per_solo_survived)

608
210
34.53947368421053

In [58]:
total_smallfamily= (df_titanic[(df_titanic.SiblingSpouse =='small family') ])
print(len(total_smallfamily))
total_smallfamily_survived = df_titanic[(df_titanic.SiblingSpouse == 'small family')& (df_titanic.Survived == 1)]
print(len (total_smallfamily_survived))
per_smallfamily_survived =len(total_smallfamily_survived)/len(total_smallfamily)*100
print(per_smallfamily_survived)

253
129
50.988142292490124

In [59]:
total_bigfamily= (df_titanic[(df_titanic.SiblingSpouse =='big family') ])
print(len(total_bigfamily))
total_bigfamily_survived = df_titanic[(df_titanic.SiblingSpouse == 'big family')& (df_titanic.Survived == 1)]
print(len (total_bigfamily_survived))
per_bigfamily_survived =len(total_bigfamily_survived)/len(total_bigfamily)*100
print(per_bigfamily_survived)

7
0
0.0

In [60]:
total_bigfamily= (df_titanic[(df_titanic.SiblingSpouse =='avg family') ])
print(len(total_bigfamily))
total_bigfamily_survived = df_titanic[(df_titanic.SiblingSpouse == 'avg family')& (df_titanic.Survived == 1)]
print(len (total_bigfamily_survived))
per_bigfamily_survived =len(total_bigfamily_survived)/len(total_bigfamily)*100
print(per_bigfamily_survived)

23
3
13.043478260869565

In [61]:
df_titanic.groupby(['SibSp','Survived']).PassengerId.count()

SibSp  Survived
0      0           398
       1           210
1      0            97
       1           112
2      0            15
       1            13
3      0            12
       1             4
4      0            15
       1             3
5      0             5
8      0             7
Name: PassengerId, dtype: int64

In [62]:
df_titanic.groupby(['Parch','Survived']).PassengerId.count()

Parch  Survived
0      0           445
       1           233
1      0            53
       1            65
2      0            40
       1            40
3      0             2
       1             3
4      0             4
5      0             4
       1             1
6      0             1
Name: PassengerId, dtype: int64

### others

### people who didnot pay all of them were male and they traveled alone. their survival rate is low . all of them embraked from s

In [69]:
total_freeT= (df_titanic[(df_titanic.Fare == 0) ])
print(len(total_freeT))
total_freeT_survived = df_titanic[(df_titanic.Fare == 0 )& (df_titanic.Survived == 1)]
print(len (total_freeT_survived))
per_freeT_survived =len(total_freeT_survived)/len(total_freeT)*100
print(per_freeT_survived)

15
1
6.666666666666667

In [70]:
df_titanic.loc[df_titanic['Fare'] == 0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin,SiblingSpouse,ParentChildren
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S,NaN,solo,solo
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S,B,solo,solo
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S,NaN,solo,solo
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S,NaN,solo,solo
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S,NaN,solo,solo
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S,NaN,solo,solo
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S,NaN,solo,solo
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S,NaN,solo,solo
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S,NaN,solo,solo
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S,NaN,solo,solo
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S,NaN,solo,solo
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S,NaN,solo,solo
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S,A,solo,solo
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S,B,solo,solo
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S,NaN,solo,solo